<?php
//  Конфигурационный массив имен
function aliases()
{
    return $aliases = [
        'part_kinds' => [
            // kind_type = 1
            'touch_screen' => [
                'for_list' => 'тачскрин',
                'for_menu' => 'Тачскрины',
                'for_h' => 'Тачскрин (сенсорный экран)',
                'for_title' => 'Сенсор',
                'for_desc' => 'Сенсорное стекло',

                'ip_ed' => 'тачскрин',
                'ip_mn' => 'тачскрины',
                'rp_mn' => 'тачскринов',
            ],
            'lcd_assembly' => [
                'for_list' => 'дисплейный модуль',
                'for_menu' => 'Дисплейные модули',
                'for_h' => 'Дисплейный модуль',
                'for_title' => 'ЖКИ дисплей в сборе с тачскрином',
                'for_desc' => 'Сенсорный lcd дисплей',

                'ip_ed' => 'дисплейный модуль',
                'ip_mn' => 'дисплейные модули',
                'rp_mn' => 'дисплейных модулей',
            ],
            'lcd' => [
                'for_list' => 'дисплей',
                'for_menu' => 'Дисплеи',
                'for_h' => 'Дисплей',
                'for_title' => 'LCD дисплей',
                'for_desc' => 'ЖКИ экран',

                'ip_ed' => 'дисплей',
                'ip_mn' => 'дисплеи',
                'rp_mn' => 'дисплеев',
            ],
            'flex_lcd' => [
                'for_list' => 'шлейф дисплея',
                'for_menu' => 'Дисплейные шлейфы',
                'for_h' => 'Дисплейный (интерфейсный) шлейф',
                'for_title' => 'Шлейф дисплейного модуля',
                'for_desc' => 'Шлейф от дисплея к основной плате',

                'ip_ed' => 'шлейф дисплея',
                'ip_mn' => 'шлейфы дисплея',
                'rp_mn' => 'дисплейных шлейфов',
            ],
            'mainboard' => [
                'for_list' => 'основная плата',
                'for_menu' => 'Основные платы',
                'for_h' => 'Основная плата',
                'for_title' => 'Основная (материнская) плата',
                'for_desc' => 'Главная плата',

                'ip_ed' => 'основная плата',
                'ip_mn' => 'дисплеи',
                'rp_mn' => 'дисплеев',
            ],
            'flex_charge' => [
                'for_list' => 'плата(шлейф) зарядки',
                'for_menu' => 'Платы зарядки',
                'for_h' => 'Плата зарядки',
                'for_title' => 'Интерфейсная плата',
                'for_desc' => 'Нижняя плата (шлейф)',
            ],
            'back_cover' => [
                'for_list' => 'крышка корпуса',
                'for_menu' => 'Крышки корпуса',
                'for_h' => 'Крышка корпуса',
                'for_title' => 'Задняя крышка',
                'for_desc' => 'Крышка АКБ',
            ],
            'glass' => [
                'for_list' => 'переднее стекло',
                'for_menu' => 'Передние стекла',
                'for_h' => 'Переднее стекло',
                'for_title' => 'Стекло экрана',
                'for_desc' => 'Стекло дисплейного модуля',
            ],
            'battery' => [
                'for_list' => 'аккумуляторная батарея',
                'for_menu' => 'Аккумуляторные батареи',
                'for_h' => 'Аккумуляторная батарея',
                'for_title' => 'Аккумулятор',
                'for_desc' => 'АКБ',
            ],
            'flex_on_off' => [
                'for_list' => 'шлейф кнопки включения(боковых кнопок)',
                'for_menu' => 'Шлейфы c кнопками',
                'for_h' => 'Шлейф кнопки включения(боковых кнопок)',
                'for_title' => 'Шлейф с кнопками',
                'for_desc' => 'Шлейф кнопок',
            ],
            'frame_lcd' => [
                'for_list' => 'рамка дисплейного модуля',
                'for_menu' => 'Дисплейные рамки',
                'for_h' => 'Рамка дисплейного модуля',
                'for_title' => 'Часть корпуса (frame lcd)',
                'for_desc' => 'Рамка дисплея',
            ],
            'buzzer' => [
                'for_list' => 'вызывной динамик',
                'for_menu' => 'Вызывные динамики',
                'for_h' => 'Вызывной динамик',
                'for_title' => 'Вызывной динамик',
                'for_desc' => 'Полифонический динамик',
            ],
            'charge_connector' => [
                'for_list' => 'разъем зарядки',
                'for_menu' => 'Разъемы зарядки',
                'for_h' => 'Разъем зарядки',
                'for_title' => 'Разъем зарядки',
                'for_desc' => 'Коннектор(системный разъем)',
            ],
            // kind_type = 2
            'ic' => [
                'for_menu' => 'Микросхемы',
                'for_list' => 'микросхема',
                'part_sub_kinds' => [
                    'charge_controller' => [
                        'for_menu' => 'Контроллеры заряда',
                        'for_list' => 'контроллер заряда',
                        'for_h' => 'Микросхема контроллера зарядки',
                        'for_title' => 'Микросхема управления зарядкой',
                        'for_desc' => 'Чип контроллера заряда',
                    ],
                    'wireless_module' => [
                        'for_menu' => 'WI-FI/BT контроллеры',
                        'for_list' => 'контроллер wi-fi/bt',
                        'for_h' => 'Микросхема wi-fi/bt контроллера',
                        'for_title' => 'WI-FI/BT микросхема',
                        'for_desc' => 'Чип wi-fi/bt',
                    ],
                    'power_management' => [
                        'for_menu' => 'Управление питанием',
                        'for_list' => 'управление питанием',
                        'for_h' => 'Микросхема управления питанием',
                        'for_title' => 'Микросхема контроллера питания',
                        'for_desc' => "Микросхема \"Power manager\"",
                    ],
                    'audio_codec' => [
                        'for_menu' => 'Audio',
                        'for_list' => 'audio codec',
                        'for_h' => 'Аудио-кодек',
                        'for_title' => 'Микросхема аудио',
                        'for_desc' => 'Звуковой чип',
                    ],
                    'other' => [
                        'for_menu' => 'Прочие',
                        'for_list' => 'прочие',
                        'for_h' => 'Микросхема',
                        'for_title' => 'Чип',
                        'for_desc' => 'Микросхема',
                    ],
                ]
            ],

            // kind_type = 3            
            'microphone' => [
                'for_list' => 'микрофон',
                'for_menu' => 'Микрофоны',
                'for_h' => 'Микрофон',
                'for_title' => 'Микрофон',
                'for_desc' => 'Микрофон',
            ],
        ],
        'dev_kinds' => [
            'tablet' => [
                'for_dev' => 'для планшетa',
                'for_devs' => 'для планшетов',
                'ip_ed' => 'планшет',
                'ip_mn' => 'планшеты',
                'rp_mn' => 'планшетов',

            ],
            'phone' => [
                'for_dev' => 'для мобильного телефона',
                'for_devs' => 'для мобильных телефонов',

                'ip_ed' => 'мобильный телефон',
                'ip_mn' => 'мобильные телефоны',
                'rp_mn' => 'мобильных телефонов',
            ],
            'watch' => [
                'for_dev' => 'для смарт-часов',
                'for_devs' => 'для смарт-часов',

                'ip_ed' => 'смарт-часы',
                'ip_mn' => 'смарт-часы',
                'rp_mn' => 'смарт-часов',
            ]
        ],

        'part_params' => [
            /* '' => [
                'for_h' => '',
            ], */
            'black_white' => [
                'for_h' => 'цвета: черный, белый',
            ],
            'white' => [
                'for_h' => 'цвет: белый',
            ],
            'black' => [
                'for_h' => 'цвет: черный',
            ],
            'left' => [
                'for_h' => 'левый',
            ],
            'right' => [
                'for_h' => 'правый',
            ],
            'left_right' => [
                'for_h' => 'левый, правый',
            ],
        ],
    ];
}

// Это конфигурационное св-во, мы не используем названия столбцов из шапки exel-таблицы, мы будем брать данные из столбца с определенным индексом (А, Б...) и записывать под индексом, который является полем нашей sql-таблицы в базе данных
function cells()
{
    return $cells =  array(
        'A' => 'dev_brand_model',
        'B' => 'part_name',
        'C' => 'part_sub_kind',
        'D' => 'part_kind',
        'E' => 'part_param',
        'F' => 'part_desc',
        'G' => 'part_en_slider',
        'H' => 'part_price',
        'J' => 'dev_kind',
    );
}




